Revit 2026 API

# UIControlledApplicationRemoveAddInCommandBinding Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveAddInCommandBinding(
	RevitCommandId revitCommandId
)
```
```vb
Public Sub RemoveAddInCommandBinding (
	revitCommandId As RevitCommandId
)
```
```cpp
public:
void RemoveAddInCommandBinding(
	RevitCommandId^ revitCommandId
)
```
```fsharp
member RemoveAddInCommandBinding :
        revitCommandId : RevitCommandId -> unit
```

#### Parameters

revitCommandId RevitCommandId

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace